{
  "backend/main.mo": "Main backend actor implementing a transport booking system with routes, bookings, reviews, user profiles, Stripe payment integration, and role-based access control (admin/user permissions).",
  "backend/migration.mo": "Migration module that preserves actor state (routes, bookings, reviews, stripeSessions, userProfiles) across canister upgrades by passing through old actor data unchanged.",
  "feature_evidence.json": "Feature evidence report documenting that BookingSummary.tsx correctly displays updated real city names and pricing with rate breakdowns for all transport types.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend component and page files, describing their functionality including route cards, booking flows, admin management, and fare breakdown displays.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark theme colors, including sidebar, chart, and UI component color tokens.",
  "frontend/index.html": "HTML entry point for the Transit Hub application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root React component configuring TanStack Router with all application routes (search, results, booking, admin, payment pages) wrapped in ThemeProvider and Toaster for notifications.",
  "frontend/src/components/AdminRouteForm.tsx": "Form component for creating and editing routes with fields for cities, transport type, operator, schedule, distance, duration, and itemized rate breakdown (base fare, taxes, service fees) with automatic total calculation.",
  "frontend/src/components/AdminRoutesTable.tsx": "Displays a table of all transportation routes with edit/delete actions, showing route details like origin, destination, operator, pricing breakdown, and transport type icons. Includes confirmation dialog for route deletion and loading states.",
  "frontend/src/components/BookingCard.tsx": "Renders a card displaying booking summary information including transport type icon, route name, operator, booking date, cost, and status badge. Provides a button to navigate to detailed booking view.",
  "frontend/src/components/BookingSummary.tsx": "Shows a detailed fare breakdown for a booking including base fare, taxes, service fees, and total cost, with support for multiple passengers or vehicle type multipliers. Displays route information and selected seats or vehicle type.",
  "frontend/src/components/CancellationModal.tsx": "Modal dialog for cancelling a booking with confirmation prompt and refund policy information. Handles booking status update to cancelled state and navigates back to bookings list on success.",
  "frontend/src/components/Layout.tsx": "Main application layout with sticky header navigation, mobile menu sheet, and footer. Conditionally displays navigation items based on authentication status and admin role.",
  "frontend/src/components/LoginButton.tsx": "Authentication button component that toggles between login and logout states using Internet Identity. Handles authentication flow, clears query cache on logout, and displays loading state during authentication.",
  "frontend/src/components/PassengerDetailsForm.tsx": "Form component for collecting passenger information including first name, last name, email, and phone number. Validates required fields and submits to proceed with payment.",
  "frontend/src/components/PaymentSetup.tsx": "Admin-only component for configuring Stripe payment integration with secret key and allowed countries. Shows alert for non-admin users indicating payment system needs configuration.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog for first-time user profile setup, collecting first name, last name, email, and phone number with form validation and submission via useSaveCallerUserProfile hook.",
  "frontend/src/components/ResultsFilters.tsx": "Filter panel component for search results with price range slider, transport type checkboxes (train/bus/taxi), and minimum rating slider.",
  "frontend/src/components/ResultsSorting.tsx": "Dropdown select component for sorting search results by price (ascending/descending), departure time, or duration.",
  "frontend/src/components/ReviewForm.tsx": "Form component for submitting route reviews with star rating selection (1-5) and text feedback, using useAddReview mutation hook.",
  "frontend/src/components/ReviewsList.tsx": "Displays a list of reviews with user avatars, star ratings, timestamps, and review text; shows empty state when no reviews exist.",
  "frontend/src/components/RouteResultCard.tsx": "Card component displaying route details (transport type, times, price, rating) with comparison checkbox, fare breakdown tooltip, and navigation to booking/details pages.",
  "frontend/src/components/SeatMap.tsx": "Interactive seat selection grid for trains/buses showing available, selected, and occupied seats with configurable rows and columns based on transport type.",
  "frontend/src/components/TaxiVehicleSelector.tsx": "Vehicle type selector for taxi bookings displaying sedan, SUV, and van options with capacity, luggage space, and price multiplier information.",
  "frontend/src/hooks/useActor.ts": "Custom hook that manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity login state and initializing access control with an admin token from URL parameters.",
  "frontend/src/hooks/useCompareRoutes.tsx": "React context and hook for managing route comparison functionality, allowing users to select up to 3 routes for side-by-side comparison with add, remove, and clear operations.",
  "frontend/src/hooks/useGetCallerUserProfile.ts": "Hook that fetches the current user's profile using React Query; currently returns null as the backend method is not yet implemented, which triggers the profile setup modal.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for managing user login/logout with the DFINITY auth client, including identity persistence and delegation validation.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating backend data including routes, bookings, reviews, shopping items, and user profiles with automatic cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark theme colors, typography styles, and utility classes using HSL color space.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/AdminCitiesPage.tsx": "Admin page for managing city routes and rates, displaying a form and table for CRUD operations on routes with access control checking for admin permissions.",
  "frontend/src/pages/BookingDetailPage.tsx": "Displays detailed information for a single booking including route details, status badges, timestamps, and cancellation functionality with modal confirmation.",
  "frontend/src/pages/BookingHistoryPage.tsx": "Displays a user's booking history organized into tabs (upcoming, completed, cancelled) with authentication check and empty state handling.",
  "frontend/src/pages/BookingPage.tsx": "Handles the booking flow including passenger details form, Stripe payment integration, and creates booking records with checkout sessions.",
  "frontend/src/pages/ComparePage.tsx": "Provides side-by-side comparison of multiple selected routes in a table format showing features like type, operator, price, duration, and departure times.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Displays a payment failure message with options to retry or return home.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Shows a success confirmation after payment with navigation to view bookings or book another trip.",
  "frontend/src/pages/ResultsPage.tsx": "Displays filtered and sorted search results for routes with sidebar filters (price, type, rating) and mobile-responsive filter sheet.",
  "frontend/src/pages/RouteDetailPage.tsx": "Shows detailed information for a specific route including schedule, pricing, operator details, reviews, and allows booking or leaving reviews for completed trips.",
  "frontend/src/pages/SearchPage.tsx": "Main search page component with a hero banner and search form for booking transportation, allowing users to select origin, destination, date, passengers, and transport mode before navigating to results.",
  "frontend/src/pages/SelectionPage.tsx": "Page for selecting seats (bus/train) or vehicles (taxi) after choosing a route, displays SeatMap or TaxiVehicleSelector components with a BookingSummary sidebar and continues to booking page.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters and sessionStorage values, supporting both standard query strings and hash-based routing.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions including OKLCH color system, container settings, custom animations, and typography/container-queries plugins.",
  "project_state.json": "Project metadata tracking feature requests to integrate real-world city names and pricing data from booking platforms like RedBus for bus, train, and taxi services across the application."
}