{
  "backend/main.mo": "Main actor implementing a transport booking system with routes, bookings, reviews, user profiles, Stripe payment integration, and role-based access control (admin/user permissions). Includes migration support for upgrading route and booking data structures.",
  "backend/migration.mo": "Migration module that transforms old route and booking data structures (without origin/destination/distance/duration fields) to new structures with these fields, initializing missing fields with default values.",
  "feature_evidence.json": "Feature evidence report documenting that search functionality for new city routes is implemented across frontend search, results, and route detail pages with high confidence.",
  "frontend-file-summaries.txt": "JSON summary of frontend components including search, results, filters, sorting, route cards, booking flow, seat selection, and user profile management with notes on temporary implementations pending backend updates.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI elements like backgrounds, borders, cards, and charts.",
  "frontend/index.html": "HTML entry point for the Transit Hub application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root React application component configuring TanStack Router with routes for search, results, booking, payment, history, comparison, and route details, wrapped in ThemeProvider with toast notifications.",
  "frontend/src/components/BookingCard.tsx": "Card component displaying booking summary with transport icon, route name, operator, booking date, cost, status badge, and navigation to booking details.",
  "frontend/src/components/BookingSummary.tsx": "Summary card showing route details, selected seats or vehicle type, price breakdown with multipliers, and total cost calculation for booking confirmation.",
  "frontend/src/components/CancellationModal.tsx": "Modal dialog for booking cancellation with refund policy information, confirmation buttons, and mutation handling to update booking status to cancelled.",
  "frontend/src/components/Layout.tsx": "Main layout component with sticky header, navigation menu (Search, Compare, My Bookings), login button, mobile sheet menu, and footer. Conditionally shows authenticated routes based on Internet Identity login status.",
  "frontend/src/components/LoginButton.tsx": "Login/logout button component that integrates with Internet Identity, handles authentication state, and clears query cache on logout. Shows loading spinner during authentication.",
  "frontend/src/components/PassengerDetailsForm.tsx": "Form component for collecting passenger details (first name, last name, email, phone) with validation and submit handler for proceeding to payment.",
  "frontend/src/components/PaymentSetup.tsx": "Admin-only component for configuring Stripe payment integration with secret key and allowed countries. Shows alert for non-admin users.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog that forces new users to complete their profile (first name, last name, email, phone) before using the app. Cannot be dismissed.",
  "frontend/src/components/ResultsFilters.tsx": "Filter panel component with price range slider, transport type checkboxes (train/bus/taxi), and minimum rating slider for filtering search results.",
  "frontend/src/components/ResultsSorting.tsx": "Dropdown select component for sorting search results by price (ascending/descending), departure time, or duration.",
  "frontend/src/components/ReviewForm.tsx": "Form component for submitting reviews with interactive star rating (1-5) and text area for review comments. Includes hover effects on stars.",
  "frontend/src/components/ReviewsList.tsx": "Displays a list of reviews with avatar, star rating visualization, timestamp, and review text. Shows empty state when no reviews exist.",
  "frontend/src/components/RouteResultCard.tsx": "Displays a single route search result with transport type, schedule, price, ratings, and comparison checkbox. Provides navigation to route details and booking pages.",
  "frontend/src/components/SeatMap.tsx": "Renders an interactive seat selection grid for trains/buses with visual indicators for available, selected, and occupied seats. Allows users to select multiple seats by clicking.",
  "frontend/src/components/TaxiVehicleSelector.tsx": "Displays selectable taxi vehicle options (sedan, SUV, van) with capacity, luggage space, and price multiplier information. Allows single vehicle selection for taxi bookings.",
  "frontend/src/hooks/useActor.ts": "Manages the backend actor instance with Internet Identity authentication, creating authenticated or anonymous actors based on login state. Invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useCompareRoutes.tsx": "Provides a React context for managing route comparison state, allowing up to 3 routes to be selected, added, removed, or cleared for side-by-side comparison.",
  "frontend/src/hooks/useGetCallerUserProfile.ts": "React Query hook to fetch the current user's profile from the backend actor. Currently returns null as the backend method is not yet implemented.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login, logout, and identity management with AuthClient. Handles identity persistence and expiration with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating routes, bookings, reviews, user profiles, and shopping items from the backend actor. Includes automatic cache invalidation on mutations.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI components (primary, secondary, destructive, etc.) and base styles for typography and utilities.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient for data fetching and InternetIdentityProvider for authentication, rendering the main App component.",
  "frontend/src/pages/BookingDetailPage.tsx": "Displays detailed information for a single booking including route details, status badges, booking time, and cost. Provides cancellation functionality via modal for confirmed bookings.",
  "frontend/src/pages/BookingHistoryPage.tsx": "Shows user's bookings organized in tabs (upcoming, completed, cancelled) with counts. Requires authentication and displays BookingCard components for each booking.",
  "frontend/src/pages/BookingPage.tsx": "Handles booking completion flow with passenger details form and Stripe checkout integration. Creates booking record and redirects to Stripe payment session.",
  "frontend/src/pages/ComparePage.tsx": "Displays side-by-side comparison table of selected routes showing features like type, operator, departure/arrival times, duration, and price. Requires at least 2 routes to compare.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Payment failure screen with error icon and options to retry payment or return to home/search pages.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Payment success confirmation screen with success icon, confirmation message, and navigation options to view bookings or book another trip.",
  "frontend/src/pages/ResultsPage.tsx": "Displays filtered and sorted route search results with mobile/desktop filter UI, sorting options, and route comparison functionality using CompareProvider.",
  "frontend/src/pages/RouteDetailPage.tsx": "Shows detailed information for a single route including schedule, pricing, operator details, average ratings, and reviews with conditional review form for users with completed bookings.",
  "frontend/src/pages/SearchPage.tsx": "Landing page with hero banner and search form for origin, destination, date, passengers, and transport mode that navigates to results page with query parameters.",
  "frontend/src/pages/SelectionPage.tsx": "Allows users to select seats (for train/bus) or vehicle (for taxi) with a booking summary sidebar before proceeding to the booking page.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters and sessionStorage values, supporting both hash-based and browser-based routing.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom OKLCH color system, container settings, extended theme with animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state file for a transport booking app tracking feature requests to add real Indian city routes and fare data from comparison with major booking sites. Contains three pending feature requests related to researching and implementing city pairs, fare data, and backend route updates."
}