{
  "backend/main.mo": "Main actor implementing a transport booking system with routes, bookings, reviews, user profiles, Stripe payment integration, and role-based access control (admin/user permissions).",
  "backend/migration.mo": "Migration module defining type aliases for all data structures (Route, Booking, Review, UserProfile, etc.) and a pass-through migration function for actor upgrades.",
  "feature_evidence.json": "Feature evidence report documenting the implementation of Red Bus route display with complete pricing breakdown in RouteResultCard and RouteDetailPage components.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend components and pages, including route display, booking flow, admin management, user profiles, and fare breakdown functionality.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark theme colors, including sidebar, chart, and UI component styling tokens.",
  "frontend/index.html": "HTML entry point for the Transit Hub application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root React component configuring TanStack Router with all application routes (search, results, booking, admin, payment) wrapped in ThemeProvider and Toaster for notifications.",
  "frontend/src/components/AdminRouteForm.tsx": "Form component for creating and editing routes with fields for origin, destination, transport type, operator, schedule, distance, duration, and itemized rate breakdown (base fare, taxes, service fees) with automatic total calculation.",
  "frontend/src/components/AdminRoutesTable.tsx": "Admin table displaying all routes with columns for transport type, cities, operator, distance, duration, itemized pricing breakdown, and actions (edit/delete with confirmation dialog).",
  "frontend/src/components/BookingCard.tsx": "Displays a booking summary card with transport icon, route details, booking date, cost, status badge, and a button to view full booking details.",
  "frontend/src/components/BookingSummary.tsx": "Shows a booking summary with route info, selected seats or vehicle type, price breakdown with multipliers, and total cost calculation.",
  "frontend/src/components/CancellationModal.tsx": "Modal dialog for cancelling a booking with refund policy information and confirmation buttons that updates booking status to cancelled.",
  "frontend/src/components/Layout.tsx": "Main application layout with sticky header navigation, mobile menu sheet, conditional nav items based on auth/admin status, and footer with outlet for child routes.",
  "frontend/src/components/LoginButton.tsx": "Authentication button that toggles between login and logout states using Internet Identity, with loading state and query cache clearing on logout.",
  "frontend/src/components/PassengerDetailsForm.tsx": "Form component for collecting passenger information (first name, last name, email, phone) with validation and submit handler for payment processing.",
  "frontend/src/components/PaymentSetup.tsx": "Admin-only component for configuring Stripe payment integration with secret key and allowed countries, showing alert for non-admin users.",
  "frontend/src/components/ProfileSetupModal.tsx": "Non-dismissible modal that prompts new users to complete their profile with first name, last name, email, and phone number before using the app.",
  "frontend/src/components/ResultsFilters.tsx": "A filter panel component for route search results that allows users to filter by price range, transport type (train/bus/taxi), and minimum rating using sliders and checkboxes.",
  "frontend/src/components/ResultsSorting.tsx": "A dropdown component that allows users to sort route results by price (ascending/descending), departure time, or duration.",
  "frontend/src/components/ReviewForm.tsx": "A form component for submitting reviews with star ratings (1-5) and text feedback, using the useAddReview mutation hook to persist reviews.",
  "frontend/src/components/ReviewsList.tsx": "Displays a list of reviews with star ratings, user avatars, timestamps, and review text, showing a placeholder message when no reviews exist.",
  "frontend/src/components/RouteResultCard.tsx": "A comprehensive card component displaying route details (transport type, times, price, rating) with fare breakdown tooltip, comparison checkbox, and navigation to booking/details pages.",
  "frontend/src/components/SeatMap.tsx": "An interactive seat selection grid component that displays available, selected, and occupied seats in a configurable layout (12 rows for trains, 10 for buses).",
  "frontend/src/components/TaxiVehicleSelector.tsx": "A vehicle selection component for taxi bookings offering sedan, SUV, and van options with capacity, luggage, and price multiplier information.",
  "frontend/src/hooks/useActor.ts": "A React Query hook that creates and manages the backend actor instance, handling authentication with Internet Identity and initializing access control with admin tokens.",
  "frontend/src/hooks/useCompareRoutes.tsx": "A React context provider and hook for managing route comparison state, allowing users to select up to 3 routes for side-by-side comparison.",
  "frontend/src/hooks/useGetCallerUserProfile.ts": "A React Query hook that fetches the current user's profile (firstName, lastName, email, phone), currently returning null as the backend endpoint is not yet implemented.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating backend data including routes, bookings, reviews, shopping items, and user profiles using the actor from useActor hook.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for theming (light/dark mode), defining colors for UI components and establishing base typography styles.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider and InternetIdentityProvider wrapping the main App component.",
  "frontend/src/pages/AdminCitiesPage.tsx": "Admin page for managing city routes and rates, checking admin permissions and rendering AdminRouteForm and AdminRoutesTable components with edit functionality.",
  "frontend/src/pages/BookingDetailPage.tsx": "Displays detailed information for a single booking including route details, status badges, timestamps, and cancellation functionality via modal.",
  "frontend/src/pages/BookingHistoryPage.tsx": "Shows user's bookings organized in tabs (upcoming, completed, cancelled) with authentication check and navigation to booking details.",
  "frontend/src/pages/BookingPage.tsx": "Handles the booking flow for a selected route, collecting passenger details and creating a Stripe checkout session. Requires user authentication and displays payment setup if Stripe is not configured.",
  "frontend/src/pages/ComparePage.tsx": "Displays a comparison table of selected routes showing features like type, operator, price, departure time, and duration. Requires at least 2 routes to be selected for comparison.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Displays a failure message when payment processing fails, with options to retry or return home.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Shows a success confirmation after successful payment with options to view bookings or book another trip.",
  "frontend/src/pages/ResultsPage.tsx": "Displays filtered and sorted search results for routes with filters for price, transport type, and rating. Includes mobile-responsive filter sheet and sorting options.",
  "frontend/src/pages/RouteDetailPage.tsx": "Shows detailed information about a specific route including schedule, pricing, operator details, and reviews. Allows authenticated users with completed bookings to submit reviews.",
  "frontend/src/pages/SearchPage.tsx": "Main search interface with a hero banner and form for entering origin, destination, date, passengers, and transport mode to find available routes.",
  "frontend/src/pages/SelectionPage.tsx": "React page component for seat/vehicle selection that displays either a SeatMap or TaxiVehicleSelector based on transport type, along with a BookingSummary and navigation to the booking page.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes using OKLCH color space, typography, animations, and design tokens for a consistent UI theme.",
  "project_state.json": "Project metadata tracking known issues with Red Bus routes not displaying, existing features for fare display, and pending requirements to fix backend storage and admin table rendering."
}