{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Display Red Bus routes and fares in application",
  "requirements": [
    {
      "id": "REQ-2",
      "summary": "Display Red Bus routes in the search results page with correct fare information showing the complete pricing breakdown",
      "acceptanceCriteria": [
        "Red Bus routes appear in search results when filtering by bus transport type",
        "Route cards display the total fare calculated from base fare + taxes + service fees",
        "Fare breakdown is visible in route details showing itemized costs"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ResultsPage.tsx",
          "operation": "modify",
          "description": "Ensure Red Bus routes are included in search results by verifying the getAllRoutes query properly fetches all routes including Red Bus. The existing transport type filter should already handle bus routes, but verify Red Bus routes with transport type 'bus' are displayed correctly in the results grid."
        },
        {
          "path": "frontend/src/components/RouteResultCard.tsx",
          "operation": "modify",
          "description": "Verify the route card displays the correct total fare for Red Bus routes. The price should be calculated from route.priceCents which must reflect the sum of baseFare + taxes + serviceFees from the rateBreakdown. Add a visual indicator or tooltip showing the fare breakdown (base fare, taxes, service fees) when users hover over or click the price."
        },
        {
          "path": "frontend/src/pages/RouteDetailPage.tsx",
          "operation": "modify",
          "description": "Add a detailed fare breakdown section in the route details view that displays the itemized costs from route.rateBreakdown. Show baseFare, taxes, serviceFees as separate line items with labels, followed by the total. Format all amounts consistently (converting from cents to currency display). Ensure this breakdown is visible for all routes including Red Bus."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Verify Red Bus routes are correctly rendered in the AdminRoutesTable with full rate breakdown details visible",
      "acceptanceCriteria": [
        "Red Bus entries appear in the admin routes table",
        "Rate breakdown columns show base fare, taxes, service fees, and total for Red Bus routes",
        "Edit and delete actions work correctly for Red Bus routes"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AdminRoutesTable.tsx",
          "operation": "modify",
          "description": "Verify that Red Bus routes appear in the admin table by ensuring the getAllRoutes query includes all routes. Enhance the table to display rate breakdown details: add columns or expand the existing price column to show baseFare, taxes, serviceFees from route.rateBreakdown, and the total priceCents. Format these amounts for readability. Ensure edit and delete actions work for Red Bus routes by testing the existing handlers with Red Bus route IDs."
        },
        {
          "path": "frontend/src/components/AdminRouteForm.tsx",
          "operation": "modify",
          "description": "Verify the route form correctly handles Red Bus route data when editing. Ensure the rate breakdown fields (baseFare, taxes, serviceFees) are properly populated when loading a Red Bus route for editing. The total calculation should automatically sum baseFare + taxes + serviceFees. Test that saving edited Red Bus routes preserves all rate breakdown data."
        }
      ]
    }
  ]
}