{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Integrate Real City Names and Rates from RedBus and Other Booking Sites",
  "requirements": [
    {
      "id": "REQ-5",
      "summary": "Update all frontend displays to correctly show real city names and accurate pricing data for bus, train, and taxi routes",
      "acceptanceCriteria": [
        "RouteResultCard displays real city names and accurate fare breakdown",
        "RouteDetailPage shows realistic pricing information",
        "AdminRoutesTable correctly renders real city data and rates",
        "Booking flow displays accurate pricing throughout the checkout process"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/RouteResultCard.tsx",
          "operation": "modify",
          "description": "Verify that the component correctly displays origin and destination city names from the route data returned by the backend. Ensure the fare breakdown tooltip shows baseFare, taxes, and serviceFees accurately from route.rateBreakdown. Update any hardcoded placeholder city names or pricing display logic if present. The component should render real city data and itemized pricing without modification if backend data is already structured correctly."
        },
        {
          "path": "frontend/src/pages/RouteDetailPage.tsx",
          "operation": "modify",
          "description": "Ensure the route detail view displays origin and destination city names accurately from the fetched route data. Verify that the pricing section shows the complete fare breakdown (baseFare, taxes, serviceFees, total) using route.rateBreakdown and route.priceCents. Remove any placeholder text or mock data references. Confirm the operator name and route details reflect real booking platform data structure."
        },
        {
          "path": "frontend/src/components/AdminRoutesTable.tsx",
          "operation": "modify",
          "description": "Update the admin table to correctly render real city names in the origin and destination columns. Ensure the pricing columns display the itemized breakdown (baseFare, taxes, serviceFees) from route.rateBreakdown accurately. Verify that table sorting and filtering work correctly with real city names and numeric pricing data. Remove any placeholder formatting or test data references."
        },
        {
          "path": "frontend/src/components/BookingSummary.tsx",
          "operation": "modify",
          "description": "Ensure the booking summary displays origin and destination city names from the selected route. Verify the price breakdown section shows baseFare, taxes, serviceFees, and total cost using route.rateBreakdown and route.priceCents. Update quantity/multiplier calculations to work with real pricing data. Confirm the total calculation reflects accurate fare components for the booking."
        },
        {
          "path": "frontend/src/components/AdminRouteForm.tsx",
          "operation": "modify",
          "description": "Verify the form fields for origin and destination accept real city names as text input. Ensure the rate breakdown section (baseFare, taxes, serviceFees fields) correctly calculates and submits itemized pricing data. Update field validation to handle realistic city names and price ranges from booking platforms. Confirm the form correctly populates when editing existing routes with real data."
        },
        {
          "path": "frontend/src/pages/BookingPage.tsx",
          "operation": "modify",
          "description": "Ensure the booking page displays origin and destination city names accurately throughout the booking flow. Verify that passenger details form and payment summary show the correct fare breakdown using route.rateBreakdown. Confirm the Stripe checkout session creation uses accurate priceInCents from real route pricing data. Update any display logic that may reference placeholder values."
        }
      ]
    }
  ]
}